FemDesign.Bars.ModelEccentricity
eccentricity_type
This class is called ModelEccentricity as Eccentricity (ecc_value_type) is the Dynamo facing class and thus need to be named accordingly.

FemDesign.Bars.ModelEccentricity.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.ModelEccentricity.#ctor(FemDesign.Bars.Eccentricity,System.Boolean)
Construct uniform ModelEccentricity with presets from Eccentricity.

FemDesign.Bars.ModelEccentricity.#ctor(FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity,System.Boolean)
Construct non-uniform ModelEccentricity with presets from Eccentricity.